IOsetting/py32f0-template/Libraries/CMSIS/Device/PY32F0xx/Include/py32f071xB.h
/******************  Bits definition for LCD_RAMx register  *******************/
#define LCD_RAM_D0_Pos               (0U)
#define LCD_RAM_D0_Msk               (0x1UL << LCD_RAM_D0_Pos)              /*!< 0x00000001 */
#define LCD_RAM_D0                   LCD_RAM_D0_Msk
#define LCD_RAM_D1_Pos               (1U)
#define LCD_RAM_D1_Msk               (0x1UL << LCD_RAM_D1_Pos)              /*!< 0x00000002 */
#define LCD_RAM_D1                   LCD_RAM_D1_Msk
#define LCD_RAM_D2_Pos               (2U)
#define LCD_RAM_D2_Msk               (0x1UL << LCD_RAM_D2_Pos)              /*!< 0x00000004 */
#define LCD_RAM_D2                   LCD_RAM_D2_Msk
#define LCD_RAM_D3_Pos               (3U)
#define LCD_RAM_D3_Msk               (0x1UL << LCD_RAM_D3_Pos)              /*!< 0x00000008 */
#define LCD_RAM_D3                   LCD_RAM_D3_Msk
#define LCD_RAM_D4_Pos               (4U)
#define LCD_RAM_D4_Msk               (0x1UL << LCD_RAM_D4_Pos)              /*!< 0x00000010 */
#define LCD_RAM_D4                   LCD_RAM_D4_Msk
#define LCD_RAM_D5_Pos               (5U)
#define LCD_RAM_D5_Msk               (0x1UL << LCD_RAM_D5_Pos)              /*!< 0x00000020 */
#define LCD_RAM_D5                   LCD_RAM_D5_Msk
#define LCD_RAM_D6_Pos               (6U)
#define LCD_RAM_D6_Msk               (0x1UL << LCD_RAM_D6_Pos)              /*!< 0x00000040 */
#define LCD_RAM_D6                   LCD_RAM_D6_Msk
#define LCD_RAM_D7_Pos               (7U)
#define LCD_RAM_D7_Msk               (0x1UL << LCD_RAM_D7_Pos)              /*!< 0x00000080 */
#define LCD_RAM_D7                   LCD_RAM_D7_Msk
#define LCD_RAM_D8_Pos               (8U)
#define LCD_RAM_D8_Msk               (0x1UL << LCD_RAM_D8_Pos)              /*!< 0x00000100 */
#define LCD_RAM_D8                   LCD_RAM_D8_Msk
#define LCD_RAM_D9_Pos               (9U)
#define LCD_RAM_D9_Msk               (0x1UL << LCD_RAM_D9_Pos)              /*!< 0x00000200 */
#define LCD_RAM_D9                   LCD_RAM_D9_Msk
#define LCD_RAM_D10_Pos              (10U)
#define LCD_RAM_D10_Msk              (0x1UL << LCD_RAM_D10_Pos)             /*!< 0x00000400 */
#define LCD_RAM_D10                  LCD_RAM_D10_Msk
#define LCD_RAM_D11_Pos              (11U)
#define LCD_RAM_D11_Msk              (0x1UL << LCD_RAM_D11_Pos)             /*!< 0x00000800 */
#define LCD_RAM_D11                  LCD_RAM_D11_Msk
#define LCD_RAM_D12_Pos              (12U)
#define LCD_RAM_D12_Msk              (0x1UL << LCD_RAM_D12_Pos)             /*!< 0x00001000 */
#define LCD_RAM_D12                  LCD_RAM_D12_Msk
#define LCD_RAM_D13_Pos              (13U)
#define LCD_RAM_D13_Msk              (0x1UL << LCD_RAM_D13_Pos)             /*!< 0x00002000 */
#define LCD_RAM_D13                  LCD_RAM_D13_Msk
#define LCD_RAM_D14_Pos              (14U)
#define LCD_RAM_D14_Msk              (0x1UL << LCD_RAM_D14_Pos)             /*!< 0x00004000 */
#define LCD_RAM_D14                  LCD_RAM_D14_Msk
#define LCD_RAM_D15_Pos              (15U)
#define LCD_RAM_D15_Msk              (0x1UL << LCD_RAM_D15_Pos)             /*!< 0x00008000 */
#define LCD_RAM_D15                  LCD_RAM_D15_Msk
#define LCD_RAM_D16_Pos              (16U)
#define LCD_RAM_D16_Msk              (0x1UL << LCD_RAM_D16_Pos)             /*!< 0x00010000 */
#define LCD_RAM_D16                  LCD_RAM_D16_Msk
#define LCD_RAM_D17_Pos              (17U)
#define LCD_RAM_D17_Msk              (0x1UL << LCD_RAM_D17_Pos)             /*!< 0x00020000 */
#define LCD_RAM_D17                  LCD_RAM_D17_Msk
#define LCD_RAM_D18_Pos              (18U)
#define LCD_RAM_D18_Msk              (0x1UL << LCD_RAM_D18_Pos)             /*!< 0x00040000 */
#define LCD_RAM_D18                  LCD_RAM_D18_Msk
#define LCD_RAM_D19_Pos              (19U)
#define LCD_RAM_D19_Msk              (0x1UL << LCD_RAM_D19_Pos)             /*!< 0x00080000 */
#define LCD_RAM_D19                  LCD_RAM_D19_Msk
#define LCD_RAM_D20_Pos              (20U)
#define LCD_RAM_D20_Msk              (0x1UL << LCD_RAM_D20_Pos)             /*!< 0x00100000 */
#define LCD_RAM_D20                  LCD_RAM_D20_Msk
#define LCD_RAM_D21_Pos              (21U)
#define LCD_RAM_D21_Msk              (0x1UL << LCD_RAM_D21_Pos)             /*!< 0x00200000 */
#define LCD_RAM_D21                  LCD_RAM_D21_Msk
#define LCD_RAM_D22_Pos              (22U)
#define LCD_RAM_D22_Msk              (0x1UL << LCD_RAM_D22_Pos)             /*!< 0x00400000 */
#define LCD_RAM_D22                  LCD_RAM_D22_Msk
#define LCD_RAM_D23_Pos              (23U)
#define LCD_RAM_D23_Msk              (0x1UL << LCD_RAM_D23_Pos)             /*!< 0x00800000 */
#define LCD_RAM_D23                  LCD_RAM_D23_Msk
#define LCD_RAM_D24_Pos              (24U)
#define LCD_RAM_D24_Msk              (0x1UL << LCD_RAM_D24_Pos)             /*!< 0x01000000 */
#define LCD_RAM_D24                  LCD_RAM_D24_Msk
#define LCD_RAM_D25_Pos              (25U)
#define LCD_RAM_D25_Msk              (0x1UL << LCD_RAM_D25_Pos)             /*!< 0x02000000 */
#define LCD_RAM_D25                  LCD_RAM_D25_Msk
#define LCD_RAM_D26_Pos              (26U)
#define LCD_RAM_D26_Msk              (0x1UL << LCD_RAM_D26_Pos)             /*!< 0x04000000 */
#define LCD_RAM_D26                  LCD_RAM_D26_Msk
#define LCD_RAM_D27_Pos              (27U)
#define LCD_RAM_D27_Msk              (0x1UL << LCD_RAM_D27_Pos)             /*!< 0x08000000 */
#define LCD_RAM_D27                  LCD_RAM_D27_Msk
#define LCD_RAM_D28_Pos              (28U)
#define LCD_RAM_D28_Msk              (0x1UL << LCD_RAM_D28_Pos)             /*!< 0x10000000 */
#define LCD_RAM_D28                  LCD_RAM_D28_Msk
#define LCD_RAM_D29_Pos              (29U)
#define LCD_RAM_D29_Msk              (0x1UL << LCD_RAM_D29_Pos)             /*!< 0x20000000 */
#define LCD_RAM_D29                  LCD_RAM_D29_Msk
#define LCD_RAM_D30_Pos              (30U)
#define LCD_RAM_D30_Msk              (0x1UL << LCD_RAM_D30_Pos)             /*!< 0x40000000 */
#define LCD_RAM_D30                  LCD_RAM_D30_Msk
#define LCD_RAM_D31_Pos              (31U)
#define LCD_RAM_D31_Msk              (0x1UL << LCD_RAM_D31_Pos)             /*!< 0x80000000 */
#define LCD_RAM_D31                  LCD_RAM_D31_Msk

/******************************************************************************/
/*                                                                            */
/*                         Low Power Timer (LPTIM)                            */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for LPTIM_ISR register  *******************/
#define LPTIM_ISR_ARRM_Pos          (1U)
#define LPTIM_ISR_ARRM_Msk          (0x1UL << LPTIM_ISR_ARRM_Pos)              /*!< 0x00000002 */
#define LPTIM_ISR_ARRM              LPTIM_ISR_ARRM_Msk                         /*!< Autoreload match */
#define LPTIM_ISR_ARROK_Pos         (4U)
#define LPTIM_ISR_ARROK_Msk         (0x1UL << LPTIM_ISR_ARROK_Pos)              /*!< 0x00000010 */
#define LPTIM_ISR_ARROK             LPTIM_ISR_ARROK_Msk                         /*!< Autoreload Update completed */

/******************  Bit definition for LPTIM_ICR register  *******************/
#define LPTIM_ICR_ARRMCF_Pos        (1U)
#define LPTIM_ICR_ARRMCF_Msk        (0x1UL << LPTIM_ICR_ARRMCF_Pos)            /*!< 0x00000002 */
#define LPTIM_ICR_ARRMCF            LPTIM_ICR_ARRMCF_Msk                       /*!< Autoreload match Clear Flag */
#define LPTIM_ICR_ARROKCF_Pos       (4U)
#define LPTIM_ICR_ARROKCF_Msk       (0x1UL << LPTIM_ICR_ARROKCF_Pos)            /*!< 0x00000010 */
#define LPTIM_ICR_ARROKCF           LPTIM_ICR_ARROKCF_Msk                       /*!< Autoreload Update completed Clear Flag */

/******************  Bit definition for LPTIM_IER register ********************/
#define LPTIM_IER_ARRMIE_Pos        (1U)
#define LPTIM_IER_ARRMIE_Msk        (0x1UL << LPTIM_IER_ARRMIE_Pos)            /*!< 0x00000002 */
#define LPTIM_IER_ARRMIE            LPTIM_IER_ARRMIE_Msk                       /*!< Autoreload match Interrupt Enable */
#define LPTIM_IER_ARROKIE_Pos       (4U)
#define LPTIM_IER_ARROKIE_Msk       (0x1UL << LPTIM_IER_ARROKIE_Pos)            /*!< 0x00000010 */
#define LPTIM_IER_ARROKIE           LPTIM_IER_ARROKIE_Msk                       /*!< Autoreload Update completed Interrupt Enable */

